### Import the necessary libraries

In [2]:
import pandas as pd
import sqlalchemy as alch

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [3]:
from getpass import getpass
password = getpass("Introduce tu contraseña ")

Introduce tu contraseña ········

### Establishes the connection to the database

In [4]:
db_name = "publications"
conec = f"mysql+pymysql://root:{password}@localhost/{db_name}"

### Remember to create the engine

In [5]:
engine = alch.create_engine(conec)
print("Connected to server!")

Connected to server!

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [19]:
challenge_1 = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, titles.title, publishers.pub_name
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN publishers ON titles.pub_id = publishers.pub_id
ORDER BY au_id;
""",engine
)

In [17]:
challenge_1.head()

,au_id,au_lname,au_fname,title,pub_name
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems

In [36]:
challenge_1b = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, titles.title, publishers.pub_name
FROM authors
INNER JOIN titleauthor ON authors.au_id = titleauthor.au_id
INNER JOIN titles ON titleauthor.title_id = titles.title_id
INNER JOIN publishers ON titles.pub_id = publishers.pub_id
ORDER BY au_id;
""",engine
)
challenge_1b.head()

,au_id,au_lname,au_fname,title,pub_name
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [11]:
challenge_2 = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, publishers.pub_name,  COUNT(titles.title)
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN publishers ON titles.pub_id = publishers.pub_id
GROUP BY authors.au_id, authors.au_id, authors.au_lname, authors.au_fname, publishers.pub_name;
""",engine
)

In [12]:
challenge_2.head()

,au_id,au_lname,au_fname,pub_name,COUNT(titles.title)
0,213-46-8915,Green,Marjorie,Algodata Infosystems,1
1,409-56-7008,Bennet,Abraham,Algodata Infosystems,1
2,267-41-2394,O'Leary,Michael,Algodata Infosystems,1
3,724-80-9391,MacFeather,Stearns,Algodata Infosystems,1
4,213-46-8915,Green,Marjorie,New Moon Books,1

In [37]:
challenge_2b = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, publishers.pub_name,  COUNT(titles.title)
FROM authors
INNER JOIN titleauthor ON authors.au_id = titleauthor.au_id
INNER JOIN titles ON titleauthor.title_id = titles.title_id
INNER JOIN publishers ON titles.pub_id = publishers.pub_id
GROUP BY authors.au_id, authors.au_id, authors.au_lname, authors.au_fname, publishers.pub_name;
""",engine
)
challenge_2b.head()

,au_id,au_lname,au_fname,pub_name,COUNT(titles.title)
0,213-46-8915,Green,Marjorie,Algodata Infosystems,1
1,409-56-7008,Bennet,Abraham,Algodata Infosystems,1
2,267-41-2394,O'Leary,Michael,Algodata Infosystems,1
3,724-80-9391,MacFeather,Stearns,Algodata Infosystems,1
4,213-46-8915,Green,Marjorie,New Moon Books,1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [22]:
#También se puede hacer utilizando inner join en lugar de join
challenge_3 = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, SUM(titles.ytd_sales) AS TOTAL
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN sales ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY TOTAL DESC
LIMIT 3;
""",engine
)

In [23]:
challenge_3.head()

         au_id  au_lname  au_fname    TOTAL
0  899-46-2035    Ringer      Anne  52672.0
1  722-51-5454  DeFrance    Michel  44492.0
2  213-46-8915     Green  Marjorie  26912.0

In [28]:
challenge_3b = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, SUM(titles.price*sales.qty) AS TOTAL
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN sales ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY TOTAL DESC
LIMIT 3;
""",engine
)

In [29]:
challenge_3b.head()

         au_id au_lname au_fname   TOTAL
0  998-72-3567   Ringer   Albert  1357.6
1  899-46-2035   Ringer     Anne  1302.2
2  427-17-2319     Dull      Ann  1000.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [27]:
#http://es.uwenku.com/question/p-bgmochem-h.html
#He utilizado la función COALESCE(field,0) no se si está bien
#También encontré la función de SELECT IFNULL(columna,0)

challenge_4 = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, 
COALESCE (SUM(titles.ytd_sales),0) AS TOTAL
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN sales ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY TOTAL DESC;
""",engine
)

In [25]:
challenge_4.head()

         au_id        au_lname  au_fname    TOTAL
0  899-46-2035          Ringer      Anne  52672.0
1  722-51-5454        DeFrance    Michel  44492.0
2  213-46-8915           Green  Marjorie  26912.0
3  648-92-1872  Blotchet-Halls  Reginald  15096.0
4  238-95-7766          Carson    Cheryl   8780.0

In [34]:
challenge_4b = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, 
IFNULL (SUM(titles.price*sales.qty),0) AS TOTAL
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN sales ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY TOTAL DESC;
""",engine
)

In [35]:
challenge_4b.head()

         au_id  au_lname au_fname   TOTAL
0  998-72-3567    Ringer   Albert  1357.6
1  899-46-2035    Ringer     Anne  1302.2
2  427-17-2319      Dull      Ann  1000.0
3  846-92-7186    Hunter   Sheryl  1000.0
4  807-91-6654  Panteley   Sylvia   838.0

In [38]:
challenge_4c = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, 
IFNULL (SUM(titles.price*sales.qty),0) AS TOTAL
FROM authors
LEFT JOIN titleauthor ON authors.au_id = titleauthor.au_id
LEFT JOIN titles ON titleauthor.title_id = titles.title_id
LEFT JOIN sales ON titles.title_id = sales.title_id
GROUP BY authors.au_id
ORDER BY TOTAL DESC;
""",engine
)
challenge_4c.head()

         au_id  au_lname au_fname   TOTAL
0  998-72-3567    Ringer   Albert  1357.6
1  899-46-2035    Ringer     Anne  1302.2
2  427-17-2319      Dull      Ann  1000.0
3  846-92-7186    Hunter   Sheryl  1000.0
4  807-91-6654  Panteley   Sylvia   838.0

## Bonus Challenge - Most Profiting Authors

In [ ]:
bonus = pd.read_sql_query(
"""
SELECT authors.au_id, authors.au_lname, authors.au_fname, (titles.advance + roysched.royalty)*titleauthor.royaltyper AS PROFIT
FROM authors
JOIN titleauthor ON authors.au_id = titleauthor.au_id
JOIN titles ON titleauthor.title_id = titles.title_id
JOIN roysched ON roysched.title_id = titles.title_id
GROUP BY authors.au_id
ORDER BY PROFIT DESC
LIMIT 3;
""",engine
)
bonus.head()